Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetConnectionStatus Method
 Returns true if a proper connection to the Tekla Structures process has been established. Currently, there's no way to re-establish the connection.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetConnectionStatus()
Public Function GetConnectionStatus As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace